#pragma once
class CD
{

public:
	void CD1();

	int CheckHit(int x1, int y1, int w1, int h1, int x2, int y2, int w2, int h2)
	{
		int L1 = x1;      // 左
		int R1 = x1 + w1; // 右(左+横幅)
		int L2 = x2;      // 左
		int R2 = x2 + w2; // 右(左+横幅)

		if (R1 <= L2) return 0; //< 線上も当たらないことにする
		if (R2 <= L1) return 0; //< 線上も当たらないことにする

		int U1 = y1;      // 上
		int D1 = y1 + h1; // 下(上+縦幅)
		int U2 = y2;      // 上
		int D2 = y2 + h2; // 下(上+縦幅)

		if (D1 <= U2) return 0; //< 線上も当たらないことにする
		if (D2 <= U1) return 0; //< 線上も当たらないことにする

		// それ以外の場合は当たっている
		return 1;
	}

protected:
	static const int SIZE_MAP_X = 32;  //< マップチップXサイズ
	static const int SIZE_MAP_Y = 32;	//< マップチップYサイズ
	static const int NUM_CHIP_X = 10;  //< 横10種類
	static const int NUM_CHIP_Y = 4;   //< 縦4種類
	static const int NUM_CHIP_ALL = NUM_CHIP_X * NUM_CHIP_Y; //< 40個
	int chip[NUM_CHIP_ALL];

	static const int NUM_MAP_X = 20; // 32x20=640
	static const int NUM_MAP_Y = 15; // 32x15=480
	int data[300] = {
		// 横20x15
		10,  10,  10,  10,  10,   10,  10,  10,  10,  10,   10,  10,  10,  10,  10,   10,  10,  10,  10, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,

		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   10,  10,  10,  10, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,

		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,
		10,  10, 10,  10,  10,   10,  10,  10,  10,  10,   10,  10,  10,  10,  10,   10,  10,  10,  10, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,
		10,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0,  0,   0,  0,  0,  0, 10,
		10, 10, 10, 10, 10,  10, 10, 10, 10, 10,  10, 10, 10, 10, 10,  10, 10, 10, 10, 10,
	};

	float x, y;    //< 表示座標
	float old_x = x;
	float old_y = y;
	float yadd = 0.2f;
	const int CHARA_WIDTH = 32;
	const int CHARA_HEIGHT = 32;

private:

};